[
  {
    "name": "Generation",
    "subcategories": [
      {
        "name": "question generation",
        "description": "Write some questions based on the given description.",
        "structure": "It is a question-generating task. Use a list to give the generated questions.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "story generation",
        "description": "Write a story based on the given description.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "poem generation",
        "description": "Write a poem based on the given description.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "email generation",
        "description": "Write an email based on the given description.",
        "structure": "It is an email-writing task. Here is a general guideline for creating a well-structured and professional email:\n1. Subject Line: Write a clear and concise subject line that accurately summarizes the content of your email. This helps the recipient understand the purpose of the email at a glance.\n2. Salutation: Begin your email with a formal salutation such as \"Dear [Recipient's Name],\" or use a more casual salutation if you have an informal relationship with the recipient.\n3. Introduction: Start your email with a brief introduction, stating who you are and the reason for writing the email. Be clear and to the point, and avoid unnecessary details.\n4. Body: This is the main content of your email. Organize your thoughts into paragraphs or bullet points to make them easier to read. Keep your sentences concise and focused. Use proper grammar, punctuation, and spelling to maintain professionalism. If you need to discuss multiple topics, consider using headings or numbered points to separate them.\n5. Politeness and Tone: Maintain a polite and respectful tone throughout your email. Be mindful of the recipient's perspective and use appropriate language. Avoid using excessive capitalization, exclamation marks, or emoticons, as they can come across as unprofessional.\n6. Closing: Conclude your email with a closing remark, such as \"Thank you,\" or \"Best regards,\" followed by your name. If you expect a response or need specific action, you can mention it in this section as well.\n7. Signature: Include your full name, job title, and contact information (e.g., phone number, email address) in your email signature. This helps the recipient easily identify and contact you if needed.\n8. Attachments: If you need to include attachments, mention them in the email body and make sure they are relevant to the email's purpose. Consider compressing large files or using cloud storage services if the attachments are too large to be sent via email.\n9. Proofread: Before sending the email, proofread it for any grammatical or spelling errors. Make sure the email conveys your message clearly and effectively.\nThe best emails are short, direct, professional, and scannable for the recipient. Follow formal business email structure unless you have an established casual rapport with the recipient.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "data generation",
        "description": "Generate data based on the given description.",
        "structure": "It is a data-generating task. Use a list to give the generated data.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "text-to-text translation",
        "description": "Translate the given text into another language.",
        "structure": "This is a translation task, please give the translated content first and then use a list to give an explanation.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      }
    ]
  },
  {
    "name": "Brainstorming",
    "subcategories": [
      {
        "name": "advice giving",
        "description": "Respond well to users when they seek advice.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "recommendations",
        "description": "Give recommendations to users.",
        "structure": "This is a task for giving recommendations. The first sentence should identify the intended purpose of the individual you are recommending. Afterward, give the recommendations to meet these objectives. Then, use a list to give the explanations. Last, give a conclusion.",
        "requires_search": true,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "how-to generation",
        "description": "Give relevant and complete answer when users ask 'how to do' something.",
        "structure": "This is a how-to question. First, analyze the question. Then, give the answer. Next, give the corresponding explanations. Last, give a conclusion.",
        "requires_search": true,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "planning",
        "description": "Write a plan for an event or activity.",
        "structure": "This is a plan-writing task. First, give the planning goals in the initial sentence. Afterward, Use a list to outline the plan by timeline. Then, give the explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Code",
    "subcategories": [
      {
        "name": "code correction",
        "description": "Correct the potential errors in a piece of code.",
        "structure": "This is a code correction task. First, output the corrected code and its corresponding comments within a code block. And then output a list to present what has been changed and why it changed.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "code simplification",
        "description": "Rewrite a piece of code to make it more concise and easy to understand.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "explain code",
        "description": "Write an explanation for a piece of code.",
        "structure": "This is a code explanation task. First, analyze the question and give a brief analysis in the first paragraph. Then, a structured format to give the explanation such as a list or table. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "text-to-code translation",
        "description": "Write a piece of code based on the given description.",
        "structure": "This is a task to write code based on text requirements. First, analyze the question and give a brief analysis in the first paragraph. Next, output the code and corresponding comments in a code block. Then, use a list to give the explanation for each piece of code. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "code-to-code translation",
        "description": "Convert the given code into another programming language.",
        "structure": "This is a task to convert the given code into another programming language. First, analyze the question and give a brief analysis in the first paragraph. Next, output the converted code and corresponding comments in a code block. Then, use a list to give the explanation for each piece of code. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "language learning questions",
        "description": "Write an answer for the given question about programming language learning.",
        "structure": "This is a task to answer the given question about programming language learning. First, analyze the question and give a brief analysis in the first paragraph. Then output the answer. Next, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "language type classification",
        "description": "Classify the programming language for the given code.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "code-to-text translation",
        "description": "Write a document for the given code.",
        "structure": "This is a task to write a document for the given code. First, analyze the question and give a brief analysis in the first paragraph. Next, take a segmented and structured way to write this document. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Rewriting",
    "subcategories": [
      {
        "name": "instructional rewriting",
        "description": "Rewrite a given text with a specific instruction.",
        "structure": "This is a guided rewrite task. First, output the rewritten content. And then output a list to present what has been changed and why it changed",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "language polishing",
        "description": "Polish a piece of text to make it more fluent, natural, and readable.",
        "structure": "It's a language polishing task. First, output the polished content. And then output a list to present what has been changed and why it changed.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "paraphrasing",
        "description": "Paraphrase a given text.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "text correction",
        "description": "Correct the potential errors in a piece of text.",
        "structure": "This is a text correction task. First, output the corrected content. And then output a list to present what has been changed and why it changed.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Extraction",
    "subcategories": [
      {
        "name": "information extraction",
        "description": "Extract one or multiple user-specified categories of information from a piece of text attached in the user's query.",
        "structure": "This is an information extraction task. Use a structured format to give the extracted information, such as a list or table.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "keywords extraction",
        "description": "Extract the keywords from a piece of text.",
        "structure": "This is a keywords extraction task. Use a list to give the keywords.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "table extraction",
        "description": "Generate a table include the key information from a piece of text attached in the user's query.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      }
    ]
  },
  {
    "name": "Summarization",
    "subcategories": [
      {
        "name": "title generation",
        "description": "Generate a title for the given text or based on a description of the work.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "text summarization",
        "description": "Write a summary for a piece of text.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "note summarization",
        "description": "Write a note to summarize a piece of text.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      }
    ]
  },
  {
    "name": "Conversation",
    "subcategories": [
      {
        "name": "open qa",
        "description": "The user's query is an open domain question with no attached passage or article.",
        "structure": "This is an open-ended question-and-answer task. First, analyze the question and give a brief analysis in the first paragraph. Next, give the answer. Then, give an explanation. Last, give a conclusion.",
        "requires_search": true,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "closed qa",
        "description": "Answer the questions that can be directly answered by the attached passage.",
        "structure": "This is a task to answer the questions that can be directly answered by the attached passage. First, analyze the question and give a brief analysis in the first paragraph. Next, give the answer. Then, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "fact verification",
        "description": "Verify if the given fact is true or false.",
        "structure": "This is a fact-verification task. First, give the answer. Then, give an explanation.",
        "requires_search": true,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "value judgement",
        "description": "Provide a value judgement on a given topic or statement.",
        "structure": "This is a value judgment task. First, analyze the question and give a brief analysis in the first paragraph. Then output the answer. Next, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "roleplay",
        "description": "Pretend to be a specific person, character, profession or identity, and complete the required task on this basis.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": false
      },
      {
        "name": "explain answer",
        "description": "Explain something the user wants to know.",
        "structure": "This is an explanation task. First, analyze the question and give a brief analysis in the first paragraph. Then, a structured format to give the explanation such as a list or table. Last, give a conclusion.",
        "requires_search": true,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Specialized Educational Dialog",
    "subcategories": [
      {
        "name": "natural language tutor",
        "description": "Write an answer for the given question about natural language learning.",
        "structure": "This is a task to answer the given question about natural language learning. First, analyze the question and give a brief analysis in the first paragraph. Then output the answer. Next, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "exam problem tutor",
        "description": "Solve an exam question (like fill-in-the-blank, multiple choice, problem solving, etc) with no math involved.",
        "structure": "This is an exam problem. First, analyze the question and give a brief analysis in the first paragraph. Then output the answer. Next, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "AI tutor",
        "description": "Write an answer for the given question about machine learning, artificial intelligence or language model.",
        "structure": "This is a question about machine learning, artificial intelligence or language model. Then output the answer. Next, give an explanation. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "math puzzles",
        "description": "Write an answer with the step-by-step reasoning process for a math question.",
        "structure": "This is a math question. First, analyze the question and give a brief analysis in the first paragraph. Then, use a list to present the step-by-step solution. Next, give another list to output a detailed explanation. Last, give the correct result and a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "fill in the blank",
        "description": "Complete the missing parts with the most appropriate words to make the text coherent and meaningful.",
        "structure": "This is a task to complete the missing parts with the most appropriate words to make the text coherent and meaningful. First, analyze the question and give a brief analysis in the first paragraph. Then, give the answer and an explanation.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Classification",
    "subcategories": [
      {
        "name": "general classification",
        "description": "Classify one or multiple objects given by the user into the specified categories.",
        "structure": "This is a classification task. First, answer. Then, explain.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "ordering",
        "description": "Sort some things, according to some criteria.",
        "structure": "This is an ordering question. First, answer. Then, explain.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "sentiment analysis",
        "description": "Identify and categorize the subjective opinions, attitudes, and feelings of the writer towards a particular subject.",
        "structure": "This is a sentiment analysis question. First, answer. Then, explain.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "language classification",
        "description": "Classify the language for the given text.",
        "structure": "This is a task to classify the language for the given text. First, answer. Then, explain.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "topic classification",
        "description": "Extract the high-level topics or themes from a given text, i.e., what kind of topics are discussed in the text.",
        "structure": "This is a task to extract the high-level topics or themes from a given text. First, answer. Then, explain.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  },
  {
    "name": "Others",
    "subcategories": [
      {
        "name": "rejecting",
        "description": "Reject to respond when the query is beyond capacity or it violates general ethical and legal rules.",
        "structure": "This question should be rejected to answer. First, reject. Then, explain why to reject.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      },
      {
        "name": "option refuser",
        "description": "You must choose what fits none of the other subcategories match the user's query well.",
        "structure": "First, analyse the question and give a brief analysis in the first paragraph. Then output the answer. Next, use a list to give explanations. Last, give a conclusion.",
        "requires_search": false,
        "requires_grounding_doc": false,
        "requires_rewrite": true
      }
    ]
  }
]